Tekla.Structures.Model.UI.Picker.PickObjectsEnum
The possible model object pick types for many objects.

Tekla.Structures.Model.UI.Picker.PickObjectsEnum.PICK_N_OBJECTS
Pick multiple model objects of any type.

Tekla.Structures.Model.UI.Picker.PickObjectsEnum.PICK_N_PARTS
Pick multiple parts.

Tekla.Structures.Model.UI.Picker.PickObjectsEnum.PICK_N_WELDS
Pick multiple welds.

Tekla.Structures.Model.UI.Picker.PickObjectsEnum.PICK_N_BOLTGROUPS
Pick multiple bolt groups.

Tekla.Structures.Model.UI.Picker.PickObjectsEnum.PICK_N_REINFORCEMENTS
Pick multiple reinforcements.